InformationRegisters/ОбновлениеАналитикиВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбновлениеАналитикиВакансий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АналитикаВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АналитикаВакансий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущееСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаТекущегоСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятоКандидатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклоненоКандидатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОдобреноКандидатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВакансий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Вакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Вакансии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаПодборПерсонала</xr:Item>
				<xr:Item>Catalog.ПрофилиДолжностей</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредполагаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаЗакрытия</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПодборПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется для единообразия с заявкой в форме «Согласование вакансий»</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетПрофилюДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОткрытияВакансий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыРаботыСКандидатами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапРаботы</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнструментОценкиХарактеристикПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОценкиХарактеристик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОценкиХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПодборПерсоналаАналитикаДанных/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.202";
	Обработчик.Процедура = "ПодборПерсоналаАналитикаДанных.ПриНачальномЗаполненииПодсистемыАналитикаДанных";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("72f8dd7a-f6bc-11ec-8499-ca102586f8a5");
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение аналитики данных: подбор персонала.'");
	
КонецПроцедуры

// Процедура выполняет начальное заполнение аналитики данных
//
// Параметры:
//  ПараметрыОбновления - Структура - описывает текущие параметры обновления:
//   * ОбработкаЗавершена - Булево
//
Процедура ПриНачальномЗаполненииПодсистемыАналитикаДанных(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПодборПерсонала.СоздатьВТВакансииПоОтбору(Запрос.МенеджерВременныхТаблиц, Новый Структура);
	
	Запрос.УстановитьПараметр("ДатаНачала", АналитикаДанных.ДатаНачалаАналитики());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ВакансииПоОтбору.Вакансия КАК Вакансия
		|ИЗ
		|	ВТВакансииПоОтбору КАК ВакансииПоОтбору
		|ГДЕ
		|	НЕ ВакансииПоОтбору.Вакансия В
		|		(ВЫБРАТЬ
		|			ОбновлениеАналитики.Вакансия КАК Вакансия
		|		ИЗ
		|			РегистрСведений.ОбновлениеАналитикиВакансий КАК ОбновлениеАналитики)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ЗарегистрироватьОбновлениеАналитикиВакансий(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// См. СинхронизацияДанныхЗарплатаКадрыИнтеграцияПодсистем.ЗаполнитьТаблицуЗависимыхДанных.
Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	// Метаданные.РегистрыСведений.КадроваяИсторияСотрудников
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.КадроваяИсторияСотрудников;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеАналитикиВакансий;
	
	// Метаданные.РегистрыСведений.СостоянияВакансий
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.СостоянияВакансий;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеАналитикиВакансий;
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

Процедура ПриОбновленииАналитикиДанных() Экспорт
	ОбновитьАналитикуВакансий();
КонецПроцедуры

#КонецОбласти

// Регистрация обновления аналитики состояний вакансий.
// 
// Параметры:
//  ТаблицаОбновления - См. НоваяТаблицаОбновлениеАналитикиВакансий
Процедура ЗарегистрироватьОбновлениеАналитикиВакансий(ТаблицаОбновления) Экспорт
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновления.Свернуть("Вакансия");
	
	УстановитьПривилегированныйРежим(Истина);
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ОбновлениеАналитикиВакансий");
	ЭлементБлокировкиДанных.ИсточникДанных = ТаблицаОбновления;
	ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Вакансия", "Вакансия");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();

	Попытка
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОбновлениеАналитикиВакансий.СоздатьНаборЗаписей();
		Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
			НаборЗаписей.Очистить();
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаТаблицы);
			НаборЗаписей.Отбор["Вакансия"].Установить(СтрокаТаблицы["Вакансия"]);
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Аналитика данных.Регистрация обновления аналитики вакансий'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#Область ОснованияДляОбновленияАналитикиДанных

// Заполняет таблицу обновления кадровой истории.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников
Процедура ЗаполнитьТаблицуОбновленияКадровойИстории(Источник) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновленияКадровойИсторииДляВакансий",
		ТаблицаОбновленияКадровойИсторииДляВакансий(Источник));
	
КонецПроцедуры

// Заполняет таблицу обновления состояний вакансий.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.СостоянияВакансий
Процедура ЗаполнитьТаблицуОбновленияСостоянийВакансий(Источник) Экспорт
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновленияСостоянияВакансий", ТаблицаОбновленияСостоянияВакансий(Источник));
КонецПроцедуры

#КонецОбласти

// При инициализации наборов регистров обновления аналитики данных.
// 
// Параметры:
//  НаборРегистров - Массив - См. АналитикаДанныхВнутренний.НаборРегистровОбновленияАналитикиДанных
Процедура ПриИнициализацииНаборовРегистровОбновленияАналитикиДанных(НаборРегистров) Экспорт
	НаборРегистров.Добавить(Метаданные.РегистрыСведений.ОбновлениеАналитикиВакансий.ПолноеИмя());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключениеСобытийОбновленияАналитикиДанных

// Зарегистрировать изменение кадровой истории сотрудников.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ЗарегистрироватьИзменениеКадровойИсторииДляПодборПерсоналаАналитикаДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеАналитикиВакансий(ТаблицаОбновленияКадровойИсторииДляВакансий(Источник));
	
КонецПроцедуры

// Зарегистрировать изменение состояний вакансий.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.СостоянияВакансий - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ЗарегистрироватьИзменениеСостоянийВакансийДляАналитикиДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеАналитикиВакансий(ТаблицаОбновленияСостоянияВакансий(Источник));
	
КонецПроцедуры

#КонецОбласти

// Конструктор таблицы обновления аналитики состояния вакансий.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Вакансия - СправочникСсылка.Вакансии 
Функция НоваяТаблицаОбновлениеАналитикиВакансий() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Вакансия", Новый ОписаниеТипов("СправочникСсылка.Вакансии"));
	Возврат Таблица;
	
КонецФункции

Функция НоваяТаблицаАналитикаВакансий()
	Возврат ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("АналитикаВакансий");
КонецФункции

Функция ТаблицаОбновленияКадровойИсторииДляВакансий(Источник)
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиВакансий();
	ИзменившиесяДанные = Источник.ТаблицаИзменившихсяДанныхНабора(); // ТаблицаЗначений
	
	Если ИзменившиесяДанные <> Неопределено Тогда
		КандидатыПоСотрудникам = ПодборПерсонала.КандидатыПоСотрудникам(ИзменившиесяДанные.ВыгрузитьКолонку("Сотрудник"));
		КандидатыПоСотрудникам.Индексы.Добавить("Сотрудник");
		ВидСобытияПрием = Перечисления.ВидыКадровыхСобытий.Прием;
		Для Каждого СтрокаТаблицы Из ИзменившиесяДанные Цикл
			КандидатыСотрудника = КандидатыПоСотрудникам.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник));
			Если КандидатыСотрудника.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Вакансия = КандидатыСотрудника[0].Вакансия;
			Если Не ЗначениеЗаполнено(Вакансия) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаТаблицы["Добавление"] = Истина И СтрокаТаблицы.НовоеЗначениеВидСобытия = ВидСобытияПрием Тогда
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Вакансия = Вакансия;
			ИначеЕсли СтрокаТаблицы["Удаление"] = Истина И СтрокаТаблицы.СтароеЗначениеВидСобытия = ВидСобытияПрием Тогда
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Вакансия = Вакансия;
			ИначеЕсли СтрокаТаблицы["ИзменилсяРесурсВидСобытия"] = Истина
					И (СтрокаТаблицы.НовоеЗначениеВидСобытия = ВидСобытияПрием Или СтрокаТаблицы.СтароеЗначениеВидСобытия = ВидСобытияПрием) Тогда
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Вакансия = Вакансия;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаОбновления;
	
КонецФункции

Функция ТаблицаОбновленияСостоянияВакансий(Источник)
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиВакансий();
	
	Если Не Источник.ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Возврат Источник.Выгрузить();
	КонецЕсли;
	
	ПрежнийНабор = Источник.ДополнительныеСвойства["ПрежнийНабор"]; // ТаблицаЗначений
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ПрежнийНабор, Источник, "Период, Вакансия, Состояние") Тогда
		Возврат ТаблицаОбновления;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Источник, ТаблицаОбновления);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПрежнийНабор, ТаблицаОбновления);
	
	Возврат ТаблицаОбновления;
	
КонецФункции

#Область Вакансии

Процедура ОбновитьАналитикуВакансий(Вакансии = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДанныеНабора.Вакансия КАК Вакансия
		|ИЗ
		|	РегистрСведений.ОбновлениеАналитикиВакансий КАК ДанныеНабора";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	Если Вакансии <> Неопределено Тогда
		ОтборЗапроса.Добавить("ДанныеНабора.Вакансия В(&Вакансии)");
		Запрос.УстановитьПараметр("Вакансии", Вакансии);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока Истина Цикл
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбновлениеАналитикиВакансий"); 
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Вакансия", "Вакансия");
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ТаблицаОбновления = РезультатЗапроса.Выгрузить();
			ТаблицаОбновления.Индексы.Добавить("Вакансия");
			ОбновитьАналитикуВакансийПоТаблице(ТаблицаОбновления);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьАналитикуВакансийПоТаблице(ТаблицаОбновления)
	
	АналитикаВакансий = НоваяТаблицаАналитикаВакансий();
	ЗаполнитьТаблицуАналитикиВакансий(АналитикаВакансий, ТаблицаОбновления);
	АналитикаВакансий.Индексы.Добавить("Вакансия");
	
	Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
		// Заполняем набор аналитики.
		НаборАналитика = РегистрыСведений.АналитикаВакансий.СоздатьНаборЗаписей();
		НаборАналитика.Отбор.Вакансия.Установить(СтрокаТаблицы.Вакансия);
		
		// Дополняем набор аналитики новыми строками.
		ОтборСтрок = Новый Структура("Вакансия", СтрокаТаблицы.Вакансия);
		НайденныеСтроки = АналитикаВакансий.НайтиСтроки(ОтборСтрок);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НайденныеСтроки, НаборАналитика);
		
		// Подготавливаем к очистке набор обновления.
		НаборОбновления = РегистрыСведений.ОбновлениеАналитикиВакансий.СоздатьНаборЗаписей();
		НаборОбновления.Отбор.Вакансия.Установить(СтрокаТаблицы.Вакансия);
		НачатьТранзакцию();
		Попытка
			НаборАналитика.Записать();
			НаборОбновления.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуАналитикиВакансий(АналитикаВакансий, ТаблицаОбновления)
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ТекущаяДата = КонецДня(ТекущаяДатаСеанса());
	ПодборПерсонала.СоздатьВТПринятыеКандидаты(Запрос.МенеджерВременныхТаблиц, АналитикаДанных.ДатаНачалаАналитики(), ТекущаяДата);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПринятыеКандидаты.Кандидат.Вакансия КАК Вакансия,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПринятыеКандидаты.ФизическоеЛицо) КАК ПринятоКандидатов
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	ВТПринятыеКандидаты КАК ПринятыеКандидаты
		|СГРУППИРОВАТЬ ПО
		|	ПринятыеКандидаты.Кандидат.Вакансия
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вакансии.Ссылка КАК Вакансия,
		|	Вакансии.ДатаОткрытия КАК НачалоПериода,
		|	Вакансии.ПланируемаяДатаЗакрытия КАК КонецПериода,
		|	РАЗНОСТЬДАТ(Вакансии.ДатаОткрытия, ВЫБОР
		|		КОГДА Вакансии.ПланируемаяДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ТекущаяДата
		|		ИНАЧЕ ВЫБОР
		|			КОГДА Вакансии.ПланируемаяДатаЗакрытия < &ТекущаяДата
		|				ТОГДА Вакансии.ПланируемаяДатаЗакрытия
		|			ИНАЧЕ &ТекущаяДата
		|		КОНЕЦ
		|	КОНЕЦ, ДЕНЬ) КАК Длительность,
		|	ТекущиеСостоянияВакансий.Состояние КАК ТекущееСостояние,
		|	ТекущиеСостоянияВакансий.Период КАК ДатаТекущегоСостояния,
		|	ЕСТЬNULL(ВТСотрудники.ПринятоКандидатов, 0) КАК ПринятоКандидатов
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий.СрезПоследних КАК ТекущиеСостоянияВакансий
		|		ПО (ТекущиеСостоянияВакансий.Вакансия = Вакансии.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ВТСотрудники
		|		ПО Вакансии.Ссылка = ВТСотрудники.Вакансия
		|ГДЕ
		|	Вакансии.Ссылка В (&Вакансии)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("Вакансии", ТаблицаОбновления.ВыгрузитьКолонку("Вакансия"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = АналитикаВакансий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
